package me.loveshare.note1.data.constant;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by Tony on 2017/7/31.
 * 静态数据
 */
public class ConstantDatas {

    /**
     * 血型
     */
    public static String[] bloodArray = {"A", "B", "AB", "O"};
    public static int[] dayArray = {20, 19, 21, 21, 21, 22, 23, 23, 23, 23, 22, 22};
    /**
     * 十二星座
     */
    public static Map<String, String> constellationMap = new HashMap<String, String>();
    public static String[] constellationList = {"水瓶座", "双鱼座", "白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座", "摩羯座"};
    /**
     * 十二生肖
     */
    public static Map<String, String> zodiacMap = new HashMap<String, String>();
    public static String[] zodiacList = {"猴", "鸡", "狗", "猪", "鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊"};
    /**
     * 省
     */
    public static Map<String, String> provinceMap = new HashMap<String, String>();
    /**
     * 学历
     */
    public static Map<String, String> eduDegreeMap = new HashMap<String, String>();
    /**
     * 性别
     */
    public static Map<String, String> sexMap = new HashMap<String, String>();

    static {
        //星座
        constellationMap.put("Aries", "白羊座");
        constellationMap.put("Taurus", "金牛座");
        constellationMap.put("Gemini", "双子座");
        constellationMap.put("Cancer", "巨蟹座");
        constellationMap.put("Leo", "狮子座");
        constellationMap.put("Virgo", "处女座");
        constellationMap.put("Libra", "天秤座");
        constellationMap.put("Scorpio", "天蝎座");
        constellationMap.put("Sagittarius", "射手座");
        constellationMap.put("Capricornus", "摩羯座");
        constellationMap.put("Aquarius", "水瓶座");
        constellationMap.put("Pisces", "双鱼座");
        //十二生肖
        zodiacMap.put("Rat", "鼠");
        zodiacMap.put("Ox", "牛");
        zodiacMap.put("Tiger", "虎");
        zodiacMap.put("Rabbit", "兔");
        zodiacMap.put("Dragon", "龙");
        zodiacMap.put("Snake", "蛇");
        zodiacMap.put("Horse", "马");
        zodiacMap.put("Goat", "羊");
        zodiacMap.put("Money", "猴");
        zodiacMap.put("Rooster", "鸡");
        zodiacMap.put("Dog", "狗");
        zodiacMap.put("Pig", "猪");
        //省
        provinceMap.put("110000", "北京市");
        provinceMap.put("120000", "天津市");
        provinceMap.put("310000", "上海市");
        provinceMap.put("500000", "重庆市");
        provinceMap.put("130000", "河北省");
        provinceMap.put("140000", "山西省");
        provinceMap.put("210000", "辽宁省");
        provinceMap.put("220000", "吉林省");
        provinceMap.put("230000", "黑龙江省");
        provinceMap.put("320000", "江苏省");
        provinceMap.put("330000", "浙江省");
        provinceMap.put("340000", "安徽省");
        provinceMap.put("350000", "福建省");
        provinceMap.put("360000", "江西省");
        provinceMap.put("370000", "山东省");
        provinceMap.put("410000", "河南省");
        provinceMap.put("420000", "湖北省");
        provinceMap.put("430000", "湖南省");
        provinceMap.put("440000", "广东省");
        provinceMap.put("460000", "海南省");
        provinceMap.put("510000", "四川省");
        provinceMap.put("520000", "贵州省");
        provinceMap.put("530000", "云南省");
        provinceMap.put("610000", "陕西省");
        provinceMap.put("620000", "甘肃省");
        provinceMap.put("630000", "青海省");
        provinceMap.put("540000", "西藏自治区");
        provinceMap.put("150000", "内蒙古自治区");
        provinceMap.put("450000", "广西壮族自治区");
        provinceMap.put("640000", "宁夏回族自治区");
        provinceMap.put("650000", "新疆维吾尔自治区");
        provinceMap.put("710000", "台湾省");
        provinceMap.put("810000", "香港特别行政区");
        provinceMap.put("820000", "澳门特别行政区");
        //学历
        eduDegreeMap.put("1", "小学");
        eduDegreeMap.put("2", "初中");
        eduDegreeMap.put("3", "高中");
        eduDegreeMap.put("4", "中专");
        eduDegreeMap.put("5", "大专");
        eduDegreeMap.put("6", "本科");
        eduDegreeMap.put("7", "硕士");
        eduDegreeMap.put("8", "博士");
        //性别
        sexMap.put("Boy", "男");
        sexMap.put("Girl", "女");
    }


    public static String[] FIRST_NAME = {"赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈",
            "楮", "卫", "蒋", "沈", "韩", "杨", "朱", "秦", "尤", "许", "何", "吕",
            "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜", "戚", "谢",
            "邹", "喻", "柏", "水", "窦", "章", "云", "苏", "潘", "葛", "奚", "范",
            "彭", "郎", "鲁", "韦", "昌", "马", "苗", "凤", "花", "方", "俞", "任",
            "袁", "柳", "酆", "鲍", "史", "唐", "费", "廉", "岑", "薛", "雷", "贺",
            "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于",
            "时", "傅", "皮", "卞", "齐", "康", "伍", "余", "元", "卜", "顾", "孟",
            "平", "黄", "和", "穆", "萧", "尹", "姚", "邵", "湛", "汪", "祁", "毛",
            "禹", "狄", "米", "贝", "明", "臧", "计", "伏", "成", "戴", "谈", "宋",
            "茅", "庞", "熊", "纪", "舒", "屈", "项", "祝", "董", "梁", "杜", "阮",
            "蓝", "闽", "席", "季", "麻", "强", "贾", "路", "娄", "危", "江", "童",
            "颜", "郭", "梅", "盛", "林", "刁", "锺", "徐", "丘", "骆", "高", "夏",
            "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "支", "柯", "昝", "管",
            "卢", "莫", "经", "房", "裘", "缪", "干", "解", "应", "宗", "丁", "宣",
            "贲", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉",
            "钮", "龚", "程", "嵇", "邢", "滑", "裴", "陆", "荣", "翁", "荀", "羊",
            "於", "惠", "甄", "麹", "家", "封", "芮", "羿", "储", "靳", "汲", "邴",
            "糜", "松", "井", "段", "富", "巫", "乌", "焦", "巴", "弓", "牧", "隗",
            "山", "谷", "车", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲",
            "伊", "宫", "宁", "仇", "栾", "暴", "甘", "斜", "厉", "戎", "祖", "武",
            "符", "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶", "郜", "黎",
            "蓟", "薄", "印", "宿", "白", "怀", "蒲", "邰", "从", "鄂", "索", "咸",
            "籍", "赖", "卓", "蔺", "屠", "蒙", "池", "乔", "阴", "郁", "胥", "能",
            "苍", "双", "闻", "莘", "党", "翟", "谭", "贡", "劳", "逄", "姬", "申",
            "扶", "堵", "冉", "宰", "郦", "雍", "郤", "璩", "桑", "桂", "濮", "牛",
            "寿", "通", "边", "扈", "燕", "冀", "郏", "浦", "尚", "农", "温", "别",
            "庄", "晏", "柴", "瞿", "阎", "充", "慕", "连", "茹", "习", "宦", "艾",
            "鱼", "容", "向", "古", "易", "慎", "戈", "廖", "庾", "终", "暨", "居",
            "衡", "步", "都", "耿", "满", "弘", "匡", "国", "文", "寇", "广", "禄",
            "阙", "东", "欧", "殳", "沃", "利", "蔚", "越", "夔", "隆", "师", "巩",
            "厍", "聂", "晁", "勾", "敖", "融", "冷", "訾", "辛", "阚", "那", "简",
            "饶", "空", "曾", "毋", "沙", "乜", "养", "鞠", "须", "丰", "巢", "关",
            "蒯", "相", "查", "后", "荆", "红", "游", "竺", "权", "逑", "盖", "益",
            "桓", "公", "万俟", "司马", "上官", "欧阳", "夏侯", "诸葛", "闻人", "东方", "赫连",
            "皇甫", "尉迟", "公羊", "澹台", "公冶", "宗政", "濮阳", "淳于", "单于", "太叔",
            "申屠", "公孙", "仲孙", "轩辕", "令狐", "锺离", "宇文", "长孙", "慕容", "鲜于",
            "闾丘", "司徒", "司空", "丌官", "司寇", "仉", "督", "子车", "颛孙", "端木", "巫马",
            "公西", "漆雕", "乐正", "壤驷", "公良", "拓拔", "夹谷", "宰父", "谷梁", "晋", "楚",
            "阎", "法", "汝", "鄢", "涂", "钦", "段干", "百里", "东郭", "南门", "呼延",
            "归", "海", "羊舌", "微生", "岳", "帅", "缑", "亢", "况", "后", "有", "琴",
            "梁丘", "左丘", "东门", "西门", "商", "牟", "佘", "佴", "伯", "赏", "南宫",
            "墨", "哈", "谯", "笪", "年", "爱", "阳", "佟"};
    public static String[] NAME_LIST = {"起振", "晨逸", "尧骏", "权晨", "祯斌", "辰加",
            "鹏福", "辰凯", "初勇", "骏加", "吉柏", "梁暄", "家振", "韦骏", "然海", "翰胤",
            "辰骏", "运帆", "运振", "胤贤", "欣骏", "振骞", "禧鸿", "琛运", "鹏运", "宇振",
            "辰荣", "震运", "震鑫", "潍运", "振辰", "帆吉", "休博", "骏辰", "初运", "骏宇",
            "振濡", "禧星", "枫凡", "帝鸿", "骞强", "瑞贤", "乘辰", "延祜", "桓泽", "锐运",
            "星骏", "骞禧", "宇逸", "裕潍", "晨驰", "骞晨", "辰博", "祥腾", "康驰", "安诚",
            "宇日", "振帝", "驰骏", "轩振", "材运", "材颜", "潍爵", "起加", "振骏", "然良",
            "裕轩", "骏树", "梓运", "宇郁", "濡炳", "胤振", "运骏", "禧初", "震轩", "初侠",
            "腾中", "腾翱", "瑞福", "楷浩", "蓓柏", "林珠", "馨玲", "祥初", "琪雯", "碧欢",
            "雅桂", "春呈", "彩雨", "瑶妍", "莲鸿", "梓月", "锦璐", "婷锦", "茜初", "岚美",
            "云雯", "锦雨", "岚晨", "雅萱", "姿彤", "梦春", "莉玥", "梅怡", "灵欣", "春弦",
            "静可", "呈沛", "蔚紫", "美蓓", "梅阳", "初雪", "欣锦", "可冰", "正慧", "香馨",
            "诗锦", "函琬", "雪雪", "玲钰", "柔彬", "春婷", "心婧", "萱锦", "春妍", "曼美",
            "舒可", "瑶彩", "珠琪", "静彩", "香蓓", "灵梦", "初桐", "雯优", "初怡", "雅帆",
            "橘月", "俊涵", "彤妍", "敏蓓", "楠芙", "云祥", "桂凡", "瑶楠", "婧梦", "静云",
            "梅雅", "香涵", "梦彩", "颖歆", "珠沛", "楠惠", "文采", "雪馨", "妍玉", "涵璐",
            "优鹤", "锦丽", "鑫彤", "正菲",
            "敏", "静", "丽", "静", "丽", "强", "静", "敏", "敏", "磊", "军", "洋",
            "勇", "勇", "艳", "杰", "磊", "强", "军", "杰", "娟", "艳", "涛", "涛",
            "明", "艳", "超", "勇", "娟", "杰", "秀兰", "霞", "敏", "军", "丽", "强",
            "平", "刚", "杰", "桂英", "芳", "　嘉懿", "煜城", "懿轩", "烨伟", "苑博", "伟泽",
            "熠彤", "鸿煊", "博涛", "烨霖", "烨华", "煜祺", "智宸", "正豪", "昊然", "明杰",
            "立诚", "立轩", "立辉", "峻熙", "弘文", "熠彤", "鸿煊", "烨霖", "哲瀚", "鑫鹏",
            "致远", "俊驰", "雨泽", "烨磊", "晟睿", "天佑", "文昊", "修洁", "黎昕", "远航",
            "旭尧", "鸿涛", "伟祺", "荣轩", "越泽", "浩宇", "瑾瑜", "皓轩", "擎苍", "擎宇",
            "志泽", "睿渊", "楷瑞", "子轩", "弘文", "哲瀚", "雨泽", "鑫磊", "修杰", "伟诚",
            "建辉", "晋鹏", "天磊", "绍辉", "泽洋", "明轩", "健柏", "鹏煊", "昊强", "伟宸",
            "博超", "君浩", "子骞", "明辉", "鹏涛", "炎彬", "鹤轩", "越彬", "风华", "靖琪",
            "明诚", "高格", "光华", "国源", "冠宇", "晗昱", "涵润", "翰飞", "翰海", "昊乾",
            "浩博", "和安", "弘博", "宏恺", "鸿朗", "华奥", "华灿", "嘉慕", "坚秉", "建明",
            "金鑫", "锦程", "瑾瑜", "晋鹏", "经赋", "景同", "靖琪", "君昊", "俊明", "季同",
            "开济", "凯安", "康成", "乐语", "力勤", "良哲", "理群", "茂彦", "敏博", "明达",
            "朋义", "彭泽", "鹏举", "濮存", "溥心", "璞瑜", "浦泽", "奇邃", "祺祥", "荣轩",
            "锐达", "睿慈", "绍祺", "圣杰", "晟睿", "思源", "斯年", "泰宁", "天佑", "同巍",
            "奕伟", "祺温", "文虹", "向笛", "心远", "欣德", "新翰", "兴言", "星阑", "修为",
            "旭尧", "炫明", "学真", "雪风", "雅昶", "阳曦", "烨熠", "英韶", "永贞", "咏德",
            "宇寰", "雨泽", "玉韵", "越彬", "蕴和", "哲彦", "振海", "正志", "子晋", "自怡",
            "德赫", "君平"};


    public static String[] ABOUT_ME = {"高尚", "谦虚", "助人为乐", "骄傲", "虚心", "傲慢", "自私",
            "无私", "忠心耿耿", "热心", "乐于助人", "眉清目秀", "一表人才", "仪表堂堂", "风度翩翩",
            "面如土色", "神情黯淡", "举止文雅", "狼吞虎咽", "欢蹦乱跳", "欢喜雀跃", "温文尔雅",
            "大大方方", "十载寒窗", "凿壁借光", "囊萤映雪", "手不释卷", "兢兢业业", "勤勤恳恳",
            "排忧解难", "仗义执言", "拔刀相助", "无微不至", "体贴入微", "铁面无私", "执法如山",
            "公私分明", "大公无私", "果断", "热情", "勇敢", "孤僻", "激情", "思想成熟", "精明能干",
            "为人诚实", "个性稳重", "雄心壮志", "积极主动", "上进心强", "精力旺盛", "思想新潮",
            "开朗成熟", "聪明", "精力充沛", "吃苦耐劳", "平易近人", "积极主动",
            "一马当先", "一身正气", "万夫不当", "无所畏惧", "气冲牛斗", "气冲霄汉", "气壮山河",
            "气宇轩昂", "气吞山河", "正气凛然", "龙骧虎步", "百战百胜", "冲锋陷阵", "英姿焕发",
            "奋不顾身", "奋勇当先", "顶天立地", "昂首挺胸", "昂首阔步", "赴汤蹈火", "挺身而出",
            "战无不胜", "临危不惧", "威震天下", "面不改色", "勇冠三军", "骁勇善战", "镇定自若",
            "慷慨就义", "大智大勇", "仰不愧天", "一视同仁", "一清二白", "大义灭亲", "大公无私",
            "义无反顾", "正气凛然", "正直无私", "执法如山", "刚正不阿", "冰清玉洁", "克己奉公",
            "严于律己", "两袖清风", "忍辱负重", "奉公守法", "表里如一", "斩钉截铁", "忠心耿耿",
            "忠贞不渝", "贫贱不移", "高风亮节", "涓滴归公", "虚怀若谷", "堂堂正正", "深明大义",
            "童叟无欺", "谦虚谨慎", "廉洁奉公", "毅然决然", "豁达大度", "鞠躬尽瘁", "死而后已",
            "襟怀坦白", "舍己为人", "舍生忘死", "舍生取义"};
}
